In [2]:
import pandas as pd
import numpy as np

### Создание Series

Serias - одна из структур данных библиотеки Pandas. Похожа на словарь, но является упорядоченной

In [3]:
a = [2, 5, 7, 8, 3]

In [4]:
b = pd.Series(a)
b

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [5]:
b = pd.Series(a, index=[1, 2, 36, 7, '44'])
b

1     2
2     5
36    7
7     8
44    3
dtype: int64

In [6]:
from datetime import date
ind = [date(y, m, d) for y, m, d in [(2018, 1,15),(2018,1,17), (2018,1,18), (2018,1,31), (2018,1,21)]]

In [7]:
b = pd.Series(a, index = ind)
b

2018-01-15    2
2018-01-17    5
2018-01-18    7
2018-01-31    8
2018-01-21    3
dtype: int64

In [8]:
b.index

Index([2018-01-15, 2018-01-17, 2018-01-18, 2018-01-31, 2018-01-21], dtype='object')

In [9]:
b.index[0].year

2018

In [10]:
b.index = pd.to_datetime(b.index, format = '%Y-%m-%d')
b.index

DatetimeIndex(['2018-01-15', '2018-01-17', '2018-01-18', '2018-01-31',
               '2018-01-21'],
              dtype='datetime64[ns]', freq=None)

In [11]:
b.index.year

Int64Index([2018, 2018, 2018, 2018, 2018], dtype='int64')

Неуникальные индексы

In [12]:
b = pd.Series(a, index = [0, 1, 0, 2, 1])
b

0    2
1    5
0    7
2    8
1    3
dtype: int64

In [13]:
b.index = [1,2,3,4,5]
b

1    2
2    5
3    7
4    8
5    3
dtype: int64

In [14]:
b = pd.Series(a, dtype = np.float64)
b

0    2.0
1    5.0
2    7.0
3    8.0
4    3.0
dtype: float64

In [15]:
b.astype(np.int64)

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [16]:
b = pd.Series({"ttr":11})
b

ttr    11
dtype: int64

###  Просмотр данных

In [17]:
b = pd.Series([5, 2, 6, 1, 6, 8, 7])

Просмотреть индексы

In [18]:
b.index

RangeIndex(start=0, stop=7, step=1)

Просмотреть данные в виде массива Numpy (ndarray)

In [20]:
b.values

array([5, 2, 6, 1, 6, 8, 7])

Доступ к данным по индексу

In [21]:
b

0    5
1    2
2    6
3    1
4    6
5    8
6    7
dtype: int64

In [22]:
b[0]

5

In [23]:
b[[0,6]]

0    5
6    7
dtype: int64

In [24]:
b.head()

0    5
1    2
2    6
3    1
4    6
dtype: int64

In [25]:
b.head(3)

0    5
1    2
2    6
dtype: int64

In [26]:
b.tail()

2    6
3    1
4    6
5    8
6    7
dtype: int64

In [29]:
b.tail(2)

5    8
6    7
dtype: int64

Выборка по условию

In [30]:
b

0    5
1    2
2    6
3    1
4    6
5    8
6    7
dtype: int64

In [31]:
b[b > 5]

2    6
4    6
5    8
6    7
dtype: int64

### Изменение элементов

In [32]:
b[0] = 4

In [33]:
b

0    4
1    2
2    6
3    1
4    6
5    8
6    7
dtype: int64

In [34]:
b[ b < 5] = 0

In [35]:
b

0    0
1    0
2    6
3    0
4    6
5    8
6    7
dtype: int64

In [36]:
b[[0,1,2]] = 4
b

0    4
1    4
2    4
3    0
4    6
5    8
6    7
dtype: int64

### Добавление данных

In [50]:
b = b.append(pd.Series({0:10, 1:15, 2:11, 9:14}))
b

3     0
4     6
5     8
6     7
6    10
7    15
8    11
9    14
6    10
7    15
8    11
9    14
6    10
7    15
8    11
9    14
0    10
1    15
2    11
9    14
dtype: int64

### Удаление данных по индексу

In [51]:
b = b.drop([0, 1, 2])
b

3     0
4     6
5     8
6     7
6    10
7    15
8    11
9    14
6    10
7    15
8    11
9    14
6    10
7    15
8    11
9    14
9    14
dtype: int64

### Запись и чтение данных из файла

In [52]:
b.to_pickle('b.pkl')

In [53]:
b2 = pd.read_pickle('b.pkl')
b2

3     0
4     6
5     8
6     7
6    10
7    15
8    11
9    14
6    10
7    15
8    11
9    14
6    10
7    15
8    11
9    14
9    14
dtype: int64

## DataFrame

DateFrame - двумерная структура данных библиотеки Pandas

### Создание DataFrame

In [57]:
df = pd.DataFrame({'Col1':['a','b','c','d','e','f','g','h'],
                  'Col2': [1, 2, 5, 7, 9, 11, 13, 15]}, columns=['Col1', 'Col2'])
df

  Col1  Col2
0    a     1
1    b     2
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

### Просмотр информации о DataFrame

In [59]:
df.shape

(8, 2)

In [60]:
df.columns

Index(['Col1', 'Col2'], dtype='object')

In [61]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
Col1    8 non-null object
Col2    8 non-null int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [63]:
df.describe()

            Col2
count   8.000000
mean    7.875000
std     5.055054
min     1.000000
25%     4.250000
50%     8.000000
75%    11.500000
max    15.000000

In [64]:
df.head()

  Col1  Col2
0    a     1
1    b     2
2    c     5
3    d     7
4    e     9

In [65]:
df.head(2)

  Col1  Col2
0    a     1
1    b     2

In [66]:
df.Col1.head(2)

0    a
1    b
Name: Col1, dtype: object

In [67]:
df['Col1'].head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

### Изменение индекса

In [68]:
df.index = [2, 4, 6, 8, 10, 12, 14, 16]
df

   Col1  Col2
2     a     1
4     b     2
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

### Выбор данных по индексу

In [69]:
df.loc[2, 'Col1']

'a'

In [70]:
df.loc[2, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [71]:
df.loc[2:4,:] #срез включает обе границы

  Col1  Col2
2    a     1
4    b     2

### Выбор данных по позиции

In [72]:
df

   Col1  Col2
2     a     1
4     b     2
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [73]:
df.iloc[0,:]

Col1    a
Col2    1
Name: 2, dtype: object

In [74]:
df.iloc[0:2,:]

  Col1  Col2
2    a     1
4    b     2

In [75]:
df.iloc[0:2,0] #срез не включает вторую границу

2    a
4    b
Name: Col1, dtype: object

### Выбор по условию

In [77]:
df.loc[df['Col1'] == 'b', :]

  Col1  Col2
4    b     2

In [78]:
df.loc[df['Col1'] == 'b', 'Col2']

4    2
Name: Col2, dtype: int64

In [79]:
df.loc[df['Col1'] == 'b', 'Col2'].values

array([2])

In [80]:
df.loc[df['Col1'] == 'b', :].values

array([['b', 2]], dtype=object)

In [86]:
df.loc[df.Col2.between(11, 13), :]

   Col1  Col2
12    f    11
14    g    13

In [88]:
df.loc[df.Col1.isin(['a','b','c','d','e']), :]

   Col1  Col2
2     a     1
4     b     2
6     c     5
8     d     7
10    e     9

In [89]:
df.loc[~df.Col1.isin(['a','b','c','d','e']), :]

   Col1  Col2
12    f    11
14    g    13
16    h    15

### Метод query

In [90]:
df

   Col1  Col2
2     a     1
4     b     2
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [91]:
df.query('Col1 =="b"')

  Col1  Col2
4    b     2

In [92]:
df.query('Col2 > 10')

   Col1  Col2
12    f    11
14    g    13
16    h    15

### Столбец DataFrame в виде Series

In [94]:
s = df['Col1']
s

2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h
Name: Col1, dtype: object

In [95]:
type(s)

pandas.core.series.Series

### Получение DataFrame из Series

In [97]:
df2 = pd.DataFrame(s)
df2

   Col1
2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h

### Копирование DataFrame

In [99]:
df_copy = df.copy()
df_copy

   Col1  Col2
2     a     1
4     b     2
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

### Случайная выборга n-го количества строк

In [101]:
df.sample(n=2)

   Col1  Col2
6     c     5
12    f    11

### Случайный выбор доли от исходного датафрейма

In [105]:
df.sample(frac = 0.5)

   Col1  Col2
14    g    13
12    f    11
10    e     9
4     b     2

### Случайный выбор с возвращением (строки могут повторяться)

In [106]:
df.sample(frac = 0.5, replace = True)

   Col1  Col2
2     a     1
8     d     7
12    f    11
6     c     5

### Случайное перемешивание

In [112]:
df.sample(frac = 1.0, random_state = 42)

   Col1  Col2
4     b     2
12    f    11
2     a     1
16    h    15
6     c     5
10    e     9
8     d     7
14    g    13

### Запись и чтение DataFrame в csv

In [114]:
df.to_csv('test.csv', sep = ';', index=False)

In [115]:
df_new = pd.read_csv('test.csv', sep=';')
df_new

  Col1  Col2
0    a     1
1    b     2
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

## Слияние данных

In [116]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Pushkin', 'Tolstoy', 'Dostoevsky']},
                      columns = ['author_id', 'author_name'])
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

In [118]:
books = pd.DataFrame({'author_id': [2, 3, 3, 4], 
                      'book_title': ["War and Peace", 'The Idiot', 'crime and Punishment', 'Fathers and sons']})
books

   author_id            book_title
0          2         War and Peace
1          3             The Idiot
2          3  crime and Punishment
3          4      Fathers and sons

### Merge

In [119]:
df1 = pd.merge(authors, books, on='author_id', how = 'inner')
df1

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  crime and Punishment

### Left merge

In [120]:
df2 = pd.merge(authors, books, on='author_id', how = 'left')
df2

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  crime and Punishment

### Right merge

In [121]:
df3 = pd.merge(authors, books, on='author_id', how = 'right')
df3

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  crime and Punishment
3          4         NaN      Fathers and sons

### Outer merge

In [122]:
df4 = pd.merge(authors, books, on='author_id', how = 'outer')
df4

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  crime and Punishment
4          4         NaN      Fathers and sons

## Работа с пропущенными данными

In [123]:
df4.loc[df4['author_name'].isnull(), :]

   author_id author_name        book_title
4          4         NaN  Fathers and sons

In [124]:
df4.loc[df4['author_name'].notnull(), :]

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  crime and Punishment

In [126]:
df4['book_title'] = df4['book_title'].fillna('unknown')
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  crime and Punishment
4          4         NaN      Fathers and sons

In [128]:
df4.author_name.fillna('unknown', inplace = True)
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  crime and Punishment
4          4     unknown      Fathers and sons

## Добавление столбцов

In [129]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['book_title'] != 'unknown'), 'quantity'] = 1
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       NaN
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  crime and Punishment       1.0
4          4     unknown      Fathers and sons       NaN

In [130]:
df4.quantity.fillna(0, inplace = True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  crime and Punishment       1.0
4          4     unknown      Fathers and sons       0.0

In [131]:
df4.quantity = df4.quantity.astype(int)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  crime and Punishment         1
4          4     unknown      Fathers and sons         0

In [132]:
df4.set_index('author_id', inplace = True)
df4

          author_name            book_title  quantity
author_id
1             Pushkin               unknown         0
2             Tolstoy         War and Peace         1
3          Dostoevsky             The Idiot         1
3          Dostoevsky  crime and Punishment         1
4             unknown      Fathers and sons         0

In [133]:
df4.reset_index(inplace = True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  crime and Punishment         1
4          4     unknown      Fathers and sons         0

## Удаление данных

Сначала добавим новый столбец:

In [134]:
df4['price'] = 500
df4

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    500
1          2     Tolstoy         War and Peace         1    500
2          3  Dostoevsky             The Idiot         1    500
3          3  Dostoevsky  crime and Punishment         1    500
4          4     unknown      Fathers and sons         0    500

In [135]:
df4 = df4.drop('price', axis = 1)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  crime and Punishment         1
4          4     unknown      Fathers and sons         0

Удаляем строку

In [136]:
df4 = df4.drop(1, axis = 0)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  crime and Punishment         1
4          4     unknown      Fathers and sons         0

## Сортировка

Вернем удаленную строку

In [142]:
df4 = df4.append(pd.DataFrame({'author_id':[2], 'author_name': ['Tolstoy'], 'book_title': ['War and Reace'], 'quantity': [1]},
                                columns = ['author_id', 'author_name', 'book_title', 'quantity']), ignore_index = True)

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
1          3  Dostoevsky             The Idiot       1.0
2          3  Dostoevsky  crime and Punishment       1.0
3          4     unknown      Fathers and sons       0.0
4          2     Tolstoy         War and Reace       NaN
5          2     Tolstoy         War and Reace       1.0

In [145]:
df4df

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
1          3  Dostoevsky             The Idiot       1.0
2          3  Dostoevsky  crime and Punishment       1.0
3          4     unknown      Fathers and sons       0.0
4          2     Tolstoy         War and Reace       NaN

In [146]:
df4 = df4.sort_values(by = 'author_id')
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
4          2     Tolstoy         War and Reace       NaN
1          3  Dostoevsky             The Idiot       1.0
2          3  Dostoevsky  crime and Punishment       1.0
3          4     unknown      Fathers and sons       0.0

In [148]:
df4 = df4.reset_index(drop = True)
df4

   index  author_id author_name            book_title  quantity
0      0          1     Pushkin               unknown       0.0
1      4          2     Tolstoy         War and Reace       NaN
2      1          3  Dostoevsky             The Idiot       1.0
3      2          3  Dostoevsky  crime and Punishment       1.0
4      3          4     unknown      Fathers and sons       0.0

## Соединение датафреймов

In [149]:
df5 = pd.DataFrame({'author_id':[3, 5], 'author_name':['Dostoevcky', 'Chekhov'], 
                   'book_title': ['The Gamlet', 'Three Sisters'], 'quantity': [2, 3]},
                  columns = ['author_id', 'author_name', 'book_title', 'quantity'])
df5

   author_id author_name     book_title  quantity
0          3  Dostoevcky     The Gamlet         2
1          5     Chekhov  Three Sisters         3

In [165]:
df6 = pd.concat([df4 ,df5], axis = 0, ignore_index = True, sort = False)
df6

   index  author_id author_name            book_title  quantity
0    0.0          1     Pushkin               unknown       0.0
1    4.0          2     Tolstoy         War and Reace       NaN
2    1.0          3  Dostoevsky             The Idiot       1.0
3    2.0          3  Dostoevsky  crime and Punishment       1.0
4    3.0          4     unknown      Fathers and sons       0.0
5    NaN          3  Dostoevcky            The Gamlet       2.0
6    NaN          5     Chekhov         Three Sisters       3.0

Конкатенация по axis = 1

In [163]:
prices = pd.DataFrame({'price':[700, 450, 500, 400, 350]},
                     columns = ['price'], index = [1, 2, 3, 5, 6])
prices

   price
1    700
2    450
3    500
5    400
6    350

In [166]:
df7 = pd.concat([df6, prices], axis = 1)
df7

   index  author_id author_name            book_title  quantity  price
0    0.0          1     Pushkin               unknown       0.0    NaN
1    4.0          2     Tolstoy         War and Reace       NaN  700.0
2    1.0          3  Dostoevsky             The Idiot       1.0  450.0
3    2.0          3  Dostoevsky  crime and Punishment       1.0  500.0
4    3.0          4     unknown      Fathers and sons       0.0    NaN
5    NaN          3  Dostoevcky            The Gamlet       2.0  400.0
6    NaN          5     Chekhov         Three Sisters       3.0  350.0

## Применение функций и методов

In [167]:
df7['total'] = df7.quantity * df7.price
df7

   index  author_id author_name            book_title  quantity  price   total
0    0.0          1     Pushkin               unknown       0.0    NaN     NaN
1    4.0          2     Tolstoy         War and Reace       NaN  700.0     NaN
2    1.0          3  Dostoevsky             The Idiot       1.0  450.0   450.0
3    2.0          3  Dostoevsky  crime and Punishment       1.0  500.0   500.0
4    3.0          4     unknown      Fathers and sons       0.0    NaN     NaN
5    NaN          3  Dostoevcky            The Gamlet       2.0  400.0   800.0
6    NaN          5     Chekhov         Three Sisters       3.0  350.0  1050.0

In [169]:
df7.price.max()

700.0

In [170]:
df7.price.min()

350.0

In [171]:
df7.price.mean() #среднее значение

480.0

In [174]:
df7.price.median()

450.0

In [175]:
df7.price.std() #среднеквадратичное отклонение

135.09256086106296

In [176]:
df7.price.var() #дисперсия

18250.0

In [177]:
df7.nlargest(3, 'price')

   index  author_id author_name            book_title  quantity  price  total
1    4.0          2     Tolstoy         War and Reace       NaN  700.0    NaN
3    2.0          3  Dostoevsky  crime and Punishment       1.0  500.0  500.0
2    1.0          3  Dostoevsky             The Idiot       1.0  450.0  450.0

In [179]:
df7.author_name.unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknown', 'Dostoevcky',
       'Chekhov'], dtype=object)

In [180]:
df6.author_name.nunique()

6

In [181]:
df7.author_name.value_counts()

Dostoevsky    2
Dostoevcky    1
Tolstoy       1
Chekhov       1
Pushkin       1
unknown       1
Name: author_name, dtype: int64

Построчное применение функций и методов

In [182]:
df7.book_title.apply(lambda x: x.upper())

0                 UNKNOWN
1           WAR AND REACE
2               THE IDIOT
3    CRIME AND PUNISHMENT
4        FATHERS AND SONS
5              THE GAMLET
6           THREE SISTERS
Name: book_title, dtype: object

## Группировка данных

1 способ

In [184]:
df7.groupby('author_name')['price'].max()

author_name
Chekhov       350.0
Dostoevcky    400.0
Dostoevsky    500.0
Pushkin         NaN
Tolstoy       700.0
unknown         NaN
Name: price, dtype: float64

2 способ

In [186]:
price_agg = df7.groupby('author_name').agg({'price':'max'})
price_agg

             price
author_name
Chekhov      350.0
Dostoevcky   400.0
Dostoevsky   500.0
Pushkin        NaN
Tolstoy      700.0
unknown        NaN

In [188]:
price_agg = price_agg.reset_index()
price_agg = price_agg.rename(columns={'price':'max_price'})
price_agg

   index author_name  max_price
0      0     Chekhov      350.0
1      1  Dostoevcky      400.0
2      2  Dostoevsky      500.0
3      3     Pushkin        NaN
4      4     Tolstoy      700.0
5      5     unknown        NaN